Data/Templates/case/0/nut
%{%(physics/Turbulence%)
%:RANS DES LES
%[_header%]
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

%{%(physics/TurbulenceModel%)
%:kEqn
internalField   uniform %(initialValues/kEqnNut%);
%:Smagorinsky WALE
internalField   uniform %(initialValues/nut%);
%:default
internalField   uniform 0;
%}

boundaryField
{

%{%(boundaries%)
%{%(boundaries/%(0%)/BoundaryType%)
%:inlet
%{%(physics/TurbulenceModel%)
%:kEqn
    %(0%)
    {
        type        fixedValue;
        value       uniform %(boundaries/%(0%)/kEqnTurbulentViscosity%);
    }
%:Smagorinsky WALE
    %(0%)
    {
        type        fixedValue;
        value       uniform %(boundaries/%(0%)/TurbulentViscosity%);
    }
%:default
    %(0%)
    {
        type        calculated;
        value       $internalField;
    }
%}
%:empty
%[0/_boundary_empty%]
%:wall
%{%(boundaries/%(0%)/BoundarySubType%)
%:fixedWall translatingWall partialSlipWall
    %(0%)
    {
%{%(physics/TurbulenceModel%)
%:SpalartAllmaras SpalartAllmarasDES SpalartAllmarasDDES SpalartAllmarasIDDES Smagorinsky
        type        nutUSpaldingWallFunction;
%:default
        type        nutkWallFunction;
%}
        value       uniform 0;
    }
%:slipWall
%[0/_boundary_zeroGradient%]
%:roughWall
    %(0%)
    {
%{%(physics/TurbulenceModel%)
%:SpalartAllmaras SpalartAllmarasDES SpalartAllmarasDDES SpalartAllmarasIDDES Smagorinsky
        type        nutURoughWallFunction;
%:default
        type        nutkRoughWallFunction;
%}
        Ks          %(boundaries/%(0%)/RoughnessHeight%); //TODO
        Cs          %(boundaries/%(0%)/RoughnessConstant%); //TODO
        value       uniform 0;
    }
%}
%:constraint
%[0/_boundary_constraint%]
%:default
%[0/_boundary_calculated%]
%}

%}
}

// ************************************************************************* //
%}