Data/Templates/case/system/changeDictionaryDict
%{%(runChangeDictionary%)
%:True
%[_header%]
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

boundary
{
%[constant/polyMesh/_boundaryPatches%]

    "defaultFaces"
    {
        type        wall;
    }

}

// ************************************************************************* //
%}